# 运算符

# 算数运算符
# +(加) -(减) *(乘) /(除) //(除，向下取整) %(取余) **(幂，类:2**5,2的5次方)

# 比较运算符
# ==(相等) !=(不相等) >(大于) <(小于) >=(大于等于) <=(小于等于)

# 赋值运算符
# = += -= *= /= //= **=(例：a**=b，a=a**b)

# 位运算符 ***
# &(按位与)
# |(按位或)
# ^(按异或)
# ~(按位取反)
# << (左移运算符)
# >> (右移运算符)

# 逻辑运算符
#  and(与) or(或) not(非)

# 成员运算符
# in not in
# 例：a in list a not in list 。存在返回True，否返回False

# 身份运算符
# is 判断两个标示是否引用与一个对象  a is b
# is not 判断两个标示是否引用与不同对象  a is not b

# 运算优先级
# 1，**
# 2，~ +(一元+,+@) -(一元-,-@)
# 3，* / % //
# 4，+ -
# 5，<< >> 
# 6，&(按为与)
# 7，^ |
# 8，< <= > >=
# 9，< > == !=
# 10 += -= *= /= //= **=
# 11 is is not
# 12 in not in
# 13 and or not