# 用 " 或 ' 包裹的字符叫字符串
# 字符串截取方法 str[start:end:gap] start--开始位置，end--结束位置，gap--间隔
# 正向标序 从0开始，反向标序，从-1开始
str1='hello world'
print(str1)
print(str1[0:6])
print(str1[:6])
# print(str1[-1:-4]) ??? 为什么不行
print(str1[:6:2])

# 转义字符
# \(在尾行时) 续行符
# \\ 反斜杠
# \' 单引号
# \" 双引号
# \a 响铃 ??? 什么鬼
# \b 退格
# \000 空格
# \n 换行
# \v 纵向制表符
# \t 横向制表符
# \r 回车
# \f 换页
# \oyy 八进制数 ??? 用途?
# \xyy 十六进制数 ??? 用途?
# \other 其它的字符以普通格式输出

# 字符串运算符
# a='a'  b='b'
# + 连字符  a+b ='ab'
# * 重复字符 a*2='aa'
# [] 获取索引对应的字符 a[1]='a'
# [s:e] 截取字符





